//
//  TYSXCRMDataCtr.m
//  tysx
//
//  Created by zwc on 14-2-21.
//  Copyright (c) 2014年 huangjia. All rights reserved.
//

#import "TYSXCRMDataCtr.h"

@implementation TYSXCRMDataCtr

- (NSArray *)orderAndCancelData {
    NSMutableArray *retArr = [NSMutableArray array];
    NSArray *titleArr = @[@"",@"当日存留", @"当日新增" ,@"当日取消"];
    [retArr addObject:titleArr];
    [retArr addObject:@[@"CRM整体",@"6108682",@"16742",@"3797"]];
    [retArr addObject:@[@"全能看CRM",@"6060758",@"16313",@"3752"]];
    [retArr addObject:@[@"股票老左上海特供",@"1944",@"199",@"0"]];
    [retArr addObject:@[@"全能看电信",@"33782",@"230",@"27"]];
    return retArr;
}

- (NSString *)orderAndCancelStr {
    return @"1.全能看CRM当日山东省新增增幅最大6631(+4925↑)是当日总新增数量突起，安徽省退订增幅最大67(-3012↓)，28日安徽与天津分省集中退订波动，已向相关部门报告\n2.当日全能看CRM停复机净值1.44万\n3.当日全能看CRM全国月累计活跃度0.03% 当日使用用户者 0.2万";
}

- (NSString *)lastDate {
    return @"2014-03-01";
}

- (NSArray *)dates {
    NSMutableArray *retArr = [NSMutableArray array];
    NSDateFormatter *dateformatter = [[NSDateFormatter alloc] init];
    [dateformatter setDateFormat:@"yyyy-MM-dd"];
    NSTimeInterval lastTime = [[dateformatter dateFromString:[self lastDate]] timeIntervalSince1970];
    
    [dateformatter setDateFormat:@"MM-dd"];
    
    for (int i = 0; i < 32; i++) {
        NSString *key = [dateformatter stringFromDate:[NSDate dateWithTimeIntervalSince1970:lastTime - 3600 * 24 * (i)]];
        [retArr insertObject:key atIndex:0];
    }
    return retArr;
}


- (NSArray *)dateLists {
    NSMutableArray *retArr = [NSMutableArray array];
    NSDateFormatter *dateformatter = [[NSDateFormatter alloc] init];
    [dateformatter setDateFormat:@"yyyy-MM-dd"];
    NSTimeInterval lastTime = [[dateformatter dateFromString:[self lastDate]] timeIntervalSince1970];
    
    [dateformatter setDateFormat:@"MM-dd"];
    
    for (int i = 0; i < 30; i++) {
        NSString *key = [dateformatter stringFromDate:[NSDate dateWithTimeIntervalSince1970:lastTime - 3600 * 24 * (i)]];
        [retArr insertObject:key atIndex:0];
    }
    return retArr;

}

- (NSArray *)provinces {
    return @[@"上海", @"重庆", @"新疆", @"湖北", @"江苏", @"山东", @"浙江", @"北京", @"广东", @"四川", @"云南", @"河北", @"安徽", @"湖南", @"内蒙古", @"天津", @"甘肃", @"陕西", @"江西", @"广西", @"福建", @"山西", @"宁夏", @"西藏", @"吉林", @"贵州", @"青海", @"辽宁", @"黑龙江", @"海南", @"河南"];
}

- (NSArray *)orderByProvinceData {
    NSMutableArray *retArr = [NSMutableArray array];
    [retArr addObject:@[@"112.9", @"63.4", @"58.2", @"57.2", @"49.2", @"45.2", @"29.8", @"29.3", @"19.9", @"18.4", @"16.4", @"17.6", @"15.5", @"10.9", @"10.1", @"9.5", @"6.7", @"6.2", @"6.1", @"4.3", @"3.4", @"2.6", @"2.6", @"2.1", @"2.2", @"1.8", @"1.3", @"1.3", @"0.9", @"0.7", @"0.3"]];
    [retArr addObject:@[@"20", @"30", @"40", @"29", @"45", @"29", @"43", @"19", @"50", @"22", @"20", @"22", @"51", @"75", @"25", @"30", @"60", @"28", @"105", @"109", @"50", @"40", @"70", @"42", @"58", @"72", @"111", @"20", @"27", @"64", @"0"]];
    return retArr;

}

- (NSArray *)orderAndCancelChartData {
    NSMutableArray *retArr = [NSMutableArray array];
    [retArr addObject:@[@"606.6",@"606.6",@"604.7",@"606.6",@"602.7",@"601.5",@"602.2",@"603.5",@"602.8",@"602.2",@"602.4",@"600.8",@"602.1",@"601.5",@"602.5",@"603.1",@"603.4",@"603.7",@"602.4",@"603.1",@"603.2",@"604.1",@"604.7",@"605.1",@"606.0",@"605.5",@"605.4",@"605.7",@"605.3",@"604.8",@"603.4",@"606.1"]];
    [retArr addObject:@[@"601.5",@"599.5",@"598.5",@"602.5",@"598.7",@"598.8",@"598.9",@"599.2",@"600.5",@"600.8",@"600.1",@"600.7",@"600",@"601.1",@"600.8",@"600.9",@"601.4",@"601.1",@"601.3",@"601.3",@"602.5",@"602.2",@"602.7",@"603.5",@"603.9",@"603",@"603.1",@"602.9",@"603.2",@"604.4",@"603.8",@"607"]];
    [retArr addObject:@[@"598.8",@"598",@"599",@"598.8",@"597.5",@"597.7",@"597.8",@"597.8",@"598",@"598.5",@"598.1",@"598.1",@"598.1",@"598.1",@"598.1",@"598.2",@"598.1",@"598.1",@"598",@"598.1",@"598.2",@"598.4",@"601.2",@"599",@"598.1",@"598.2",@"599.7",@"599",@"599.2",@"599.7",@"603.8",@"599.5"]];
    return retArr;
}

- (NSArray *)cemChartData {
    NSMutableArray *retArr = [NSMutableArray array];
    [retArr addObject:@[@"607.7", @"607.4", @"608.3", @"609.3", @"609.9", @"610.1", @"610.4", @"610.8", @"611.1", @"610.0", @"610.6", @"609.6", @"610.4", @"611.4", @"610.8", @"611.5", @"610.5", @"609.1", @"608.2", @"608.8", @"607.9", @"607.3", @"607.0", @"604.0", @"604.6", @"599.8", @"602.3", @"601.6", @"597.4", @"602.1", @"602.8", @"604.9"]];
    [retArr addObject:@[@"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @"", @""]];
    return retArr;

}

- (NSArray *)crmDetails {
    return @[@"1.新增降幅主要来自于新疆（-949↓）；当日退订数量26省有降幅，降幅最大的是北京（-46↓）",@"2.当日全国月累计活跃度2.19%。当日使用用户数2.08万（+0.38万↑）；\n当日各省月累计活跃度均值为1.29%(+0.45%)。福建活跃度环比增幅较大，即+11.57%，福建已连续多日活跃度增幅较大。"];
}

- (NSArray *)crmProvinceTableData {
    NSMutableArray *retArr = [NSMutableArray array];
    [retArr addObject:@[@"", @"昨日新增", @"当日新增", @"新增环比", @"昨日取消", @"当日取消", @"取消环比", @"昨日月累计活跃度", @"当日月累计活跃度", @"环比"]];
    [retArr addObject:@[@"总计", @"11234", @"16313", @"5079", @"11447", @"3752", @"-7695", @"0.0352", @"0.0004", @"-0.0348"]];
    [retArr addObject:@[@"新疆", @"2706", @"3383", @"677", @"194", @"287", @"93", @"0.0049", @"0.0003", @"-0.0046"]];
    [retArr addObject:@[@"湖北", @"2356", @"1617", @"-739", @"266", @"79", @"-187", @"0.0036", @"0.0002", @"-0.0034"]];
    [retArr addObject:@[@"山东", @"1706", @"6631", @"4925", @"786", @"96", @"-690", @"0.0039", @"0.0002", @"-0.0037"]];
    [retArr addObject:@[@"重庆", @"1029", @"535", @"-494", @"1086", @"222", @"-864", @"0.0039", @"0.0002", @"-0.0037"]];
    [retArr addObject:@[@"上海", @"941", @"633", @"-308", @"540", @"526", @"-14", @"0.0026", @"0.0002", @"-0.0024"]];
    [retArr addObject:@[@"江苏", @"809", @"410", @"-399", @"1380", @"306", @"-1074", @"0.0120", @"0.0004", @"-0.0116"]];
    [retArr addObject:@[@"天津", @"437", @"1115", @"678", @"1577", @"165", @"-1412", @"0.0025", @"0.0002", @"-0.0023"]];
    [retArr addObject:@[@"浙江", @"432", @"242", @"-190", @"215", @"80", @"-135", @"0.0039", @"0.0003", @"-0.0035"]];
    [retArr addObject:@[@"吉林", @"192", @"177", @"-15", @"156", @"11", @"-145", @"0.0034", @"0.0005", @"-0.0030"]];
    [retArr addObject:@[@"河北", @"170", @"1296", @"1126", @"147", @"1349", @"1202", @"0.0045", @"0.0002", @"-0.0042"]];
    [retArr addObject:@[@"广东", @"159", @"169", @"10", @"295", @"56", @"-239", @"0.0079", @"0.0004", @"-0.0075"]];
    [retArr addObject:@[@"宁夏", @"103", @"24", @"-79", @"28", @"6", @"-22", @"0.0103", @"0.0005", @"-0.0098"]];
    [retArr addObject:@[@"北京", @"67", @"32", @"-35", @"387", @"64", @"-323", @"0.0032", @"0.0002", @"-0.003"]];
    [retArr addObject:@[@"云南", @"60", @"29", @"-31", @"241", @"42", @"-199", @"0.0058", @"0.0002", @"-0.0056"]];
    [retArr addObject:@[@"福建", @"29", @"12", @"-17", @"44", @"13", @"-31", @"0.8343", @"0.0004", @"-0.8339"]];
    [retArr addObject:@[@"青海", @"15", @"0", @"-15", @"3", @"1", @"-2", @"0.0122", @"0.0060", @"-0.0116"]];
    [retArr addObject:@[@"山西", @"7", @"0", @"-7", @"318", @"1", @"-317", @"0.0103", @"0.0003", @"-0.01"]];
    [retArr addObject:@[@"江西", @"5", @"2", @"-3", @"47", @"6", @"-41", @"0.0305", @"0.0008", @"-0.0297"]];
    [retArr addObject:@[@"贵州", @"4", @"2", @"-2", @"76", @"6", @"-70", @"0.0276", @"0.0009", @"-0.0267"]];
    [retArr addObject:@[@"湖南", @"3", @"0", @"-3", @"165", @"34", @"-131", @"0.0086", @"0.0005", @"-0.0080"]];
    [retArr addObject:@[@"四川", @"2", @"2", @"0", @"153", @"68", @"-85", @"0.0039", @"0.0002", @"-0.0037"]];
    [retArr addObject:@[@"辽宁", @"1", @"1", @"0", @"1", @"80", @"79", @"0.0066", @"0.0002", @"-0.0064"]];
    [retArr addObject:@[@"甘肃", @"1", @"0", @"-1", @"103", @"25", @"-78", @"0.0067", @"0.0005", @"-0.0062"]];
    [retArr addObject:@[@"广西", @"0", @"1", @"1", @"23", @"95", @"72", @"0.0134", @"0.0009", @"-0.0125"]];
    [retArr addObject:@[@"安徽", @"0", @"0", @"0", @"3079", @"67", @"-3012", @"0.0158", @"0.0004", @"-0.0154"]];
    [retArr addObject:@[@"内蒙古", @"0", @"0", @"0", @"8", @"3", @"-5", @"0.0036", @"0.0001", @"-0.0034"]];
    [retArr addObject:@[@"陕西", @"0", @"0", @"0", @"90", @"33", @"-57", @"0.0057", @"0.0002", @"-0.0055"]];
    [retArr addObject:@[@"海南", @"0", @"0", @"0", @"22", @"4", @"-18", @"0.0176", @"0.0005", @"-0.0170"]];
    [retArr addObject:@[@"西藏", @"0", @"0", @"0", @"4", @"1", @"-3", @"0.0097", @"0.0003", @"-0.0094"]];
    [retArr addObject:@[@"黑龙江", @"0", @"0", @"0", @"3", @"26", @"23", @"0.0056", @"0.0002", @"-0.0054"]];
    [retArr addObject:@[@"河南", @"0", @"0", @"0", @"10", @"0", @"-10", @"0.0070", @"0.0000", @"-0.0070"]];
    [retArr addObject:@[@"其它", @"0", @"0", @"0", @"0", @"0", @"0", @"0", @"0", @"0"]];
    [retArr addObject:@[@"澳门", @"0", @"0", @"0", @"0", @"0", @"0", @"0", @"0", @"0"]];
    

    return retArr;

}

@end
